app/views/bridesmaids/_bridesmaid_dresses.html.erb

        Dress Material: <%= bridesmaid.dress.material %><br>
        Length: <%= bridesmaid.dress.length %> inches<br>
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]