app/views/bridesmaids/_form.html.erb

    <%= f.label :dress_id, 'Pick a Dress' %>
    <%= collection_select(:dress, :id, Dress.all, :id, :link,
   {:prompt => 'Pick a Dress'}) %>
---
SELECT "dresses".* FROM "dresses"