app/views/bridesmaids/index.html.erb

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    Dress Material: <%= bridesmaid.dress.material %><br>
    Length: <%= bridesmaid.dress.length %>