app/controllers/brides_controller.rb

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
  def show
    @bride = Bride.find(params[:id])

SELECT "brides".* FROM "brides"
---
  def index
    @brides = Bride.all

INSERT INTO "brides" ("name", "password_digest", "grooms_name") VALUES (?, ?, ?)  [["name", "Alyssa"], ["password_digest", "$2a$10$..bLPDMwWrLOCt1y8EpEEufkbJCxc7jUBJlkChmLNUsL5IWrn/LV6"], ["grooms_name", "Adam"]]
---
  def create
    @bride = Bride.new(bride_params)
    if @bride.save

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    #byebug
    @bride = Bride.find(params[:id])

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "brides" SET "password_digest" = ?, "grooms_name" = ? WHERE "brides"."id" = ?  [["password_digest", "$2a$10$b.aN.eTMuMj4.EjMSbAbW.zrtAdFlAussoZgRPyFbPxyxtaCxhCR."], ["grooms_name", "Daniel Graham"], ["id", 2]]
---
  def update
    @bride = Bride.find(params[:id])
    if @bride.update(bride_params)