app/controllers/bridesmaids_controller.rb

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT "dresses".* FROM "dresses"
---
    def new
        @bride = Bride.find(params[:bride_id])
        @bridesmaid = @bride.bridesmaids.build
        @dresses = Dress.all

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
INSERT INTO "bridesmaids" ("name", "bride_id", "dress_id") VALUES (?, ?, ?)  [["name", ""], ["bride_id", 47], ["dress_id", 1]]
INSERT INTO "dresses" ("link", "material", "length") VALUES (?, ?, ?)  [["link", "something"], ["material", "something"], ["length", 34]]
---
    def create
        @bridesmaid = Bridesmaid.new(bridesmaid_params)
        @bridesmaid.dress = Dress.find(params[:bridesmaid][:dress_id])
        @bride = Bride.find(params[:bride_id ])
        if @bridesmaid.save

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        @bride = Bride.find(params[:bride_id])

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bridesmaids".* FROM "bridesmaids" WHERE "bridesmaids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "dresses".* FROM "dresses"
---
    def edit
        @bride = Bride.find(params[:bride_id])
        @bridesmaid = Bridesmaid.find(params[:id])
        @dress = Dress.find(@bridesmaid.dress_id)
        @dresses = Dress.all

SELECT  "bridesmaids".* FROM "bridesmaids" WHERE "bridesmaids"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bridesmaids" SET "name" = ?, "dress_id" = ? WHERE "bridesmaids"."id" = ?  [["name", "Mary Tanner"], ["dress_id", 5], ["id", 4]]
---
    def update
        @bridesmaid = Bridesmaid.find(params[:id])
        @bridesmaid.name = bridesmaid_params[:name]
        @bridesmaid.dress = Dress.find(params[:bridesmaid][:dress_id])u
        @bride = Bride.find(params[:bride_id])
        if @bridesmaid.save

SELECT  "bridesmaids".* FROM "bridesmaids" WHERE "bridesmaids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @bridesmaid = Bridesmaid.find(params[:id])

SELECT  "brides".* FROM "brides" WHERE "brides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bridesmaids".* FROM "bridesmaids" WHERE "bridesmaids"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bridesmaids" WHERE "bridesmaids"."id" = ?  [["id", 3]]
---
    def destroy
        @bride = Bride.find(params[:bride_id])
        @bridesmaid = Bridesmaid.find(params[:id])
        @bridesmaid.destroy