app/controllers/comments_controller.rb

    def index
		@dress = Dress.find(params[:dress_id])
        @comments = @dress.comments.all
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."dress_id" = ?  [["dress_id", 3]]

    def new
        @dress = Dress.find(params[:dress_id])
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @dress = Dress.find(params[:dress_id])
        @comment = @dress.comments.new(comment_params)
        if @comment.save
---
SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "dress_id", "comment") VALUES (?, ?, ?, ?)  [["created_at", "2019-01-06 05:28:56.637601"], ["updated_at", "2019-01-06 05:28:56.637601"], ["dress_id", 1], ["comment", "love!"]]

    def show
        #byebug
		@comment= Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]