app/controllers/dresses_controller.rb

SELECT "dresses".* FROM "dresses"
---
    def index
        @dresses = Dress.all

INSERT INTO "dresses" ("link", "material", "length") VALUES (?, ?, ?)  [["link", "dress link"], ["material", "silk"], ["length", 0]]
---
    def create
        @dress = Dress.new(dress_params)
        if @dress.save

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @dress = Dress.find(params[:id])

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."dress_id" = ?  [["dress_id", 1]]
---
    def show
        @dress = Dress.find(params[:id])
        @comments = @dress.comments.all

SELECT  "dresses".* FROM "dresses" WHERE "dresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "dresses" SET "link" = ?, "length" = ? WHERE "dresses"."id" = ?  [["link", "https://cdn-1.azazie.com/upimg/o390/b0/b4/3f2572d81867bcae99b0ed0ed3cfb0b4.jpg"], ["length", 55], ["id", 1]]
---
    def update
        @dress = Dress.find(params[:id])
        if @dress.update(dress_params)