app/controllers/sessions_controller.rb

INSERT INTO "brides" ("name", "uid") VALUES (?, ?)  [["name", "Alyssa Watson"], ["uid", "10156597331953885"]]
SELECT  "brides".* FROM "brides" WHERE "brides"."uid" = ? LIMIT ?  [["uid", "10156597331953885"], ["LIMIT", 1]]
SELECT  "brides".* FROM "brides" WHERE "brides"."name" = ? LIMIT ?  [["name", "Alyssa"], ["LIMIT", 1]]
---
      def create
        if params[:code].present?
          @bride= Bride.find_or_create_by(uid: auth['uid']) do |b|
            b.name = auth['info']['name']
          end
          session[:bride_id] = @bride.id
          redirect_to bride_path(@bride)
        else
          @bride = Bride.find_by(name: params[:bride][:name])